kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/App/FuelGuage/FuelGuage_App.c
    /******************************************************************************************
 * Feature Name: FuelGuage.c
 *
 * Feature Short Name: FuelGuage
 *
 * Description: FuelGuage.c file performs to find the current
 and update the last display Fuel level.
 *
 * Author: Saikumar kurella.
 *
 * Create Date: 22-Feb-2024
 *
 * Copyright:  All information contained herein is, and remains the property of
 * eSTAR TECHNOLOGIES(OPC) PRIVATE LIMITED and its suppliers, if any.
 * Dissemination of this information or reproduction of this material is strictly
 * forbidden unless prior written permission is obtained from
 * eSTAR TECHNOLOGIES(OPC) PRIVATE LIMITED
 *****************************************************************************************/

/**************************************************************************************************
 * Include Platform or Standard Headers
***************************************************************************************************/
#include "stdio.h"
#include "stdbool.h"
#include "stdint.h"

/**************************************************************************************************
 * Include Project Specific Headers
***************************************************************************************************/

#include "FuelGuage_App.h"
#include "FuelGuage_App_cfg.h"
#include "damp_out.h"
#include "IGN_SmHandler.h"
#include "stm32h7xx_hal.h"


/**************************************************************************************************
 * DEFINE FILE SCOPE MACROS
***************************************************************************************************/

/**************************************************************************************************
 * DECLARE GLOBAL VARIABLES
***************************************************************************************************/
Main_DATA MainData;
Sub_DATA SubData;
IndicationStatus_t IndicationStatus;
/**************************************************************************************************
 * Purpose: The purpose of usADCValue variable is to store the ADC value and used in application.
 *
 * Unit: 16 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 65535
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
extern uint16_t usADCValue;

/**************************************************************************************************
 * Purpose: The purpose of usCurrentFuelLevel variable is to store the current fuel level.
 *
 * Unit: 16 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 65535
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
uint16_t usCurrentFuelLevel;


/**************************************************************************************************
 * DEFINE FILE SCOPE TYPES
***************************************************************************************************/

/**************************************************************************************************
 * DECLARE FILE SCOPE STATIC VARIABLES
***************************************************************************************************/
/**************************************************************************************************
 * Purpose: The purpose of ulFuelLevelInPercentage variable is to store the fuel level in percentage.
 *
 * Unit: 32 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 4294967295
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint32_t ulFuelLevelInPercentage;

/**************************************************************************************************
 * Purpose: The purpose of ulDampout_value variable is to store the updated damp out value with step size parameter.
 *
 * Unit: 32 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 4294967295
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint32_t ulDampout_value;

/**************************************************************************************************
 * Purpose: The purpose of usADCValues_A array is store the continuous moving average values from ADC.
 *
 * Unit: 16 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 65535
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint16_t usADCValues_A[configWINDOW_SIZE];

/**************************************************************************************************
 * Purpose: The purpose of usSampleCount variable is to keep track of the number of samples
 *
 * Unit: 16 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 65535
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint16_t usSampleCount = 0;

/**************************************************************************************************
 * Purpose: The purpose of usTotalSum variable is to add and store the total sum of ADC values
 *
 * Unit: 16 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 65535
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint16_t usTotalSum = 0;

