kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/App/FuelGuage/FuelGuage_App.c
/**************************************************************************************************
 * Purpose: The purpose of ucInitialSamplingOverFlag flag to indicate if initial sampling process is over
 *
 * Unit: 8 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 255
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint8_t ucInitialSamplingOverFlag=0;

/**************************************************************************************************
 * Purpose: The purpose of ucFillTypeDetctOverFlag flag to indicate if fill type detection process is over
 *
 * Unit: 8 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 255
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint8_t ucFillTypeDetctOverFlag=0;

/**************************************************************************************************
 * Purpose: The purpose of usFastFillCount variable to count the duration of fast fill operation
 *
 * Unit: 16 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 65535
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint16_t usFastFillCount;

/**************************************************************************************************
 * Purpose: The purpose of  usSlowFillCount variable to count the duration of slow fill operation
 *
 * Unit: 16 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 65535
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint16_t usSlowFillCount;

/**************************************************************************************************
 * Purpose: The purpose of usNormalFillCount variable to count the duration of normal fill operation
 *
 * Unit: 16 bit
 *
 * Resolution: 1 Bit
 *
 * Range: 0 to 65535
 *
 * Power On Init Value\Action: 0
 *
 * Wakeup Value\Action: 0
 *
 * Shutdown Value\Action: Don't Care
 *
 ***************************************************************************************************/
static uint16_t usNormalFillCount;

static FillType_State_T l_FillType_t;
static FillType_State_T l_Previous_FillType_t;
static FillType_State_T l_Current_FillType_t;


extern uint16_t l_count_u16[1];

/**************************************************************************************************
 * DEFINE FILE SCOPE FUNCTION PROTOTYPES
***************************************************************************************************/
static uint16_t prvInitalSamplingProcess(void);
static FillType_State_T prvOfflineFillTypeDtcnPrcs(void);
static FillType_State_T prvOnlineFillTypeDtcnPrcs(void);
static void prvSetFuelLevel(void);
static uint16_t prvCalculateAverage(void);
/**************************************************************************************************
 * FUNCTION DEFINITIONS
***************************************************************************************************/

/**************************************************************************************************
 * Function Name: vFuelGuageTaskInit
 *
 * Input Parameter: void
 *
 * Return Value: void
 *
 * Description: This function is designed to Initialize the main state.
 *
 ***************************************************************************************************/
void vFuelGuageTaskInit(void)
{
    MainData.Main_state = INIT_Sampling_State;
    
}

/**************************************************************************************************vFuelGuageTask
 *
 * Function Name: 
 * Input Parameter: void
 *
 * Return Value: void
 *
 * Description: This function is designed to update the fuelLevel
 *
 ***************************************************************************************************/
void vFuelGuageTask(void)
{

    
    switch(MainData.Main_state)
    {
        
        case INIT_Sampling_State:
        {
        	/**:Perform initial sampling process to get the continuous moving average values for 3sec time period;*/
            usCurrentFuelLevel = prvInitalSamplingProcess();
#if(FuelApp_TestMacro == 1)
            printf("CFL-%d\r\n",usCurrentFuelLevel);
            printf("IGN_OFF\n");
#endif
            /**Check if enough samples are accumulated and ignition is ON for state transition*/
            if(usSampleCount >= configWINDOW_SIZE)
            {
                if ((usIgnitionGetCurrentState() == IgnON_mode) && (ucInitialSamplingOverFlag==1))
                {
                	/**:Reset sample count;*/
                	usSampleCount=0;
                	/**:Transition to Offline_FillType_Dtcn_State:*/
                    MainData.Main_state = Offline_FillType_Dtcn_State;
                }
            }
            break;
        }
        case Offline_FillType_Dtcn_State:
        {
        	/**:Perform offline fill type detection process to check the current fill type;*/
            l_FillType_t = prvOfflineFillTypeDtcnPrcs();
            /**:Update current fill type;*/
            l_Current_FillType_t = l_FillType_t;
#if(FuelApp_TestMacro ==1)
            printf("IGN_ON\n");
#endif
            /**Check if ignition is ON and fill type detection is over for state transition*/
            if((usIgnitionGetCurrentState() == IgnON_mode) && (ucFillTypeDetctOverFlag==1))
            {
                 if((l_FillType_t == Normal_fill) || (l_FillType_t == Slow_fill))
                {
                	/**:Transition to Online_Process_State;*/
                    MainData.Main_state = Online_Process_State;
                    /**: Set sub-state;*/
                    SubData.Sub_state = l_FillType_t;
                }
                else /*Instantaneous_Update*/ 
                {
                	/**:perform vUpdateParametrs function to update the min time and step size of Instantaneous_Update filter;*/
                	vUpdateParametrs(configINSTANTANEOUS_FILTER_UPDATERATE, configINSTANTANEOUS_FILTER_STEPSIZE);
#if(FuelApp_TestMacro ==1)
                    printf("CFL-%d\t",usCurrentFuelLevel);
                    printf("IUCnt %d\t", configINSTANTANEOUS_FILTER_UPDATERATE );
                    printf("IUSiz %d\t",configINSTANTANEOUS_FILTER_STEPSIZE);
#endif
                    /**:Perform damp_out task to update the dampout value to the current fuel level;*/
                    DAMP_OUT ();
                    /**: Get the updated damp out value;*/
                    ulDampout_value = Get_DAMP_OUT(0);
                    /**: perform Set fuel level function to update the fuel level in percentage;*/
                    prvSetFuelLevel();
                    /**:Transition to Online_Process_State;*/
                    MainData.Main_state = Online_Process_State;
                    /**: Set sub-state to invalid;*/
                    SubData.Sub_state = Invalid;
                }
            }
            break;
        }
        case Online_Process_State:
        {
#if(FuelApp_TestMacro ==1)
        	printf("IGN_ON: \r\n");
#endif
            switch(SubData.Sub_state)
            {
                case Fast_fill:
                {
                	/**check if the Previous_FillType and Current_FillType is not same*/
                    if(l_Previous_FillType_t != l_Current_FillType_t)
                    {
                    	/**: Reset fast fill count;*/
                        l_count_u16[0]= 0;
                    }
                    /**Execute fast fill process within a timeout period*/
                    while(usFastFillCount <= configFASTFILL_TIMEOUT_MS)
                    {
                    	/**check if Current_FuelLevel and Dampout_values are equal*/
                        if(usCurrentFuelLevel == ulDampout_value )
                        {
                        	/**:Reset fast fill count;*/
                            usFastFillCount=0;
                            /**:Exit loop if current fuel level matches damp out value;*/
                            break;
                        }
                        else
                        {
                        	/**:Increment fast fill count;*/
                            usFastFillCount++;
                            /**:perform vUpdateParametrs function to update the min time and step size of Fast Fill filter;*/
                            vUpdateParametrs(configFAST_FILL_LOSS_FILTER_UPDATERATE, configFAST_FILL_LOSS_FILTER_STEPSIZE);
#if(FuelApp_TestMacro ==1)
                            printf("CFL-%d\t",usCurrentFuelLevel);
                            printf("FFCnt %d\t", configFAST_FILL_LOSS_FILTER_UPDATERATE );
                            printf("FFSiz %d\t",configFAST_FILL_LOSS_FILTER_STEPSIZE);
#endif
                            /**:Perform damp_out task to update the dampout value to the current fuel level;*/
                            DAMP_OUT ();
                            /**: Get the updated damp out value;*/
                            ulDampout_value = Get_DAMP_OUT(0);
                            /**: perform Set fuel level function to update the fuel level in percentage;*/
                            prvSetFuelLevel();
                        }
                    }      
                    break;
                }
                case Slow_fill:
                {
                	/**check if the Previous_FillType and Current_FillType is not same*/
                    if(l_Previous_FillType_t != l_Current_FillType_t)
                    {
                    	/**: Reset slow fill count;*/
                        l_count_u16[0]= 0;
                    }
                    /**Execute slow fill process within a timeout period*/
                    while(usSlowFillCount <= configSLOWFILL_TIMEOUT_MS)
                    {
                    	/**check if Current_FuelLevel and Dampout_values are equal*/
                         if(usCurrentFuelLevel == ulDampout_value )
                        {
                        	/**:Reset slow fill count;*/
                            usSlowFillCount=0;
                            /**Exit loop if current fuel level matches damp out value*/
                            break;
                        }
                        else
                        {
                        	/**:Increment slow fill count;*/
                            usSlowFillCount++;
                            /**:perform vUpdateParametrs function to update the min time and step size of Slow Fill filter;*/
                            vUpdateParametrs(configSLOW_FILL_LOSS_FILTER_UPDATERATE, configSLOW_FILL_LOSS_FILTER_STEPSIZE);
#if(FuelApp_TestMacro ==1)
                            printf("CFL-%d\t",usCurrentFuelLevel);
                            printf("SFCnt %d\t",configSLOW_FILL_LOSS_FILTER_UPDATERATE);
                            printf("SFSiz %d\t",configSLOW_FILL_LOSS_FILTER_STEPSIZE);
#endif
                            /**:Perform damp_out task to update the dampout value to the current fuel level;*/
                            DAMP_OUT ();
                            /**: Get the updated damp out value;*/
                            ulDampout_value = Get_DAMP_OUT(0);
                            /**: perform Set fuel level function to update the fuel level in percentage;*/
                            prvSetFuelLevel();    
                        }   
                    }
                    break;
                }
                case Normal_fill:
                {
                	/**check if the Previous_FillType and Current_FillType is not same*/
                    if(l_Previous_FillType_t != l_Current_FillType_t)
                    {
                    	/**: Reset Normal fill count;*/
                        l_count_u16[0]= 0;
                    }
                    /**Execute Normal fill process within a timeout period*/
                    while(usNormalFillCount <= configNORMALFILL_TIMEOUT_MS)
                    {
                    	/**check if Current_FuelLevel and Dampout_values are equal*/
                        if(usCurrentFuelLevel == ulDampout_value )
                        {
                        	/**:Reset slow fill count;*/
                            usNormalFillCount=0;
                            /**:Exit loop if current fuel level matches damp out value;*/
                            break;
                        }
                        else
                        {
                        	/**:Increment Normal fill count;*/
                            usNormalFillCount++;
                            /**:perform vUpdateParametrs function to update the min time and step size of Normal Fill filter;*/
                            vUpdateParametrs(configNORMAL_FILL_LOSS_FILTER_UPDATERATE, configNORMAL_FILL_LOSS_FILTER_STEPSIZE);
#if(FuelApp_TestMacro ==1)
                            printf("CFL-%d\t",usCurrentFuelLevel);
                            printf("NFCnt %d\t", configNORMAL_FILL_LOSS_FILTER_UPDATERATE);
                            printf("NFSiz %d\t",configNORMAL_FILL_LOSS_FILTER_STEPSIZE);
#endif
                            /**:Perform damp_out task to update the dampout value to the current fuel level;*/
                            DAMP_OUT ();
                            /**: Get the updated damp out value;*/
                            ulDampout_value = Get_DAMP_OUT(0);
                            /**: perform Set fuel level function to update the fuel level in percentage;*/
                            prvSetFuelLevel();
                        }
                             
