kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/App/FuelGuage/FuelGuage_App.c
                    }     
                    break;
                }
                default:
                {
                    break;
                } 
            }
            /**: Update previous fill type with Current_FillType;*/
            l_Previous_FillType_t=l_Current_FillType_t;
            /**:Perform online fill type detection process to check the current fill type in online;*/
            l_FillType_t = prvOnlineFillTypeDtcnPrcs();
            /**: Update current fill type;*/
            l_Current_FillType_t = l_FillType_t;
            /**:Update sub-state based on fill type;*/
            /**check if fill type is Fast fill*/
            if(l_FillType_t == Fast_fill)
            {
            	/**:Set sub-state to Fast_fill;*/
                SubData.Sub_state = Fast_fill;
            }
            /**check if fill type is Slow fill*/
            else if(l_FillType_t == Slow_fill)
            {
            	/**: Set sub-state to Slow_fill;*/
                SubData.Sub_state = Slow_fill;
            }
            else
            {
            	/**:Set sub-state to Normal_fill;*/
                SubData.Sub_state = Normal_fill;
            }
            /**Check ignition state for state transition*/
            if(usIgnitionGetCurrentState() == IgnOFF_mode)
            {
            	/**:Transition to INIT_Sampling_State;*/
                MainData.Main_state = INIT_Sampling_State;
            }
            break;
        }
        default:
        {
            break;
        }   
    } 
}

/**************************************************************************************************
 * Function Name: prvInitalSamplingProcess
 *
 * Input Parameter: void
 *
 * Return Value: void
 *
 * Description: This function is designed to calculate the 3sec continuous moving average value.
 *
 ***************************************************************************************************/
static uint16_t prvInitalSamplingProcess(void)
{
	/**:Variable to store the Resulting calculated average;*/
    uint16_t l_res_t=0;
    /**:Variable to store the Sensor value from ADC;*/
    uint16_t fl_sensorValue_u16;
    /**: Static variable to track the circular buffer index;*/
    static uint8_t l_currentIndex_u8 = 0;
    
    fl_sensorValue_u16 = usADCValue;
    /**: Store the value in the circular buffer;*/
    usADCValues_A[l_currentIndex_u8] = fl_sensorValue_u16;

    /**: Move to the next index in the circular buffer;*/
    l_currentIndex_u8 = (l_currentIndex_u8 + 1) % configWINDOW_SIZE;

    /**: Accumulate the ADC values;*/
    usTotalSum += fl_sensorValue_u16;
    usSampleCount++;

    /** If we have accumulated enough samples, calculate the average*/
    if (usSampleCount >= configWINDOW_SIZE)
    {

    	/*:do the avaerage calculation of adc samples;*/
        l_res_t = prvCalculateAverage();
        /*:set ucInitialSamplingOverFlag flag bit tp 1;*/
        ucInitialSamplingOverFlag=1;

        /**: Subtract the oldest sample from the total sum;*/
        usTotalSum -= usADCValues_A[l_currentIndex_u8];
    
    }
    /**:Return the calculated average;*/
    return l_res_t;
    
}

/**************************************************************************************************
 * Function Name: prvOfflineFillTypeDtcnPrcs.
 *
 * Input Parameter: void
 *
 * Return Value: void
 *
 * Description: This function is designed to detect the fillType(slow_fill,Normal_fill,Instantaneous_update)in offline.
 *
 ***************************************************************************************************/
static FillType_State_T prvOfflineFillTypeDtcnPrcs(void)
{
	/**:Variable to store the difference between current and last displayed levels;*/
    uint16_t fl_delta_u16;
    /**:Variable to store the Resulting fill type state;*/
    FillType_State_T l_res_t;
    /**:Variable to store the Last displayed fuel level;*/
    uint16_t fl_Last_Displayed_Level_u16;
    
    /**: Get the last displayed fuel level from dampout value;*/
    fl_Last_Displayed_Level_u16 = (uint16_t)ulDampout_value;
    /**: Calculate the difference between current fuel level and last displayed levels;*/
    if(usCurrentFuelLevel > fl_Last_Displayed_Level_u16 )
    {
        fl_delta_u16 = usCurrentFuelLevel - fl_Last_Displayed_Level_u16;
    }
    else
    {
        fl_delta_u16 = fl_Last_Displayed_Level_u16 - usCurrentFuelLevel;
    }
    /**:set the ucFillTypeDetctOverFlag to 1 after offline fill type detection completed;*/
    ucFillTypeDetctOverFlag=1;

    /**: Determine fill type based on the difference;*/
    /**check if delta is greater than or equal to configFAST_FILL_RANGE*/
    if(fl_delta_u16 >= configFAST_FILL_RANGE)
    {
    	/**: set fill type is Instantaneous_Update;*/
        l_res_t = Instantaneous_Update;
    }
    /**check if delta is greater than or equal to  configSLOW_FILL_RANGE and less than configFAST_FILL_RANGE*/
    else if((fl_delta_u16 >= configSLOW_FILL_RANGE) && (fl_delta_u16 < configFAST_FILL_RANGE))
    {
    	/**: set fill type is Slow_fill;*/
        l_res_t = Slow_fill;
    }
    else
    {
    	/**: set fill type is Normal_fill;*/
        l_res_t = Normal_fill;
    }
    /**:Return the fill type state;*/
    return l_res_t;
}

/**************************************************************************************************
 * Function Name:  prvOnlineFillTypeDtcnPrcs
 *
 * Input Parameter: void
 *
 * Return Value: void
 *
 * Description: This function is designed to detect the fillType(slow_fill,Normal_fill, Fast_fill)in online.
 *
 ***************************************************************************************************/
static FillType_State_T prvOnlineFillTypeDtcnPrcs(void)
{
	/**:Variable to store the difference between current fuel level and last displayed levels;*/
    uint16_t fl_delta_u16;
    /**:Resulting fill type state;*/
    FillType_State_T l_res_t;
    /**:Variable to store the Damp_out value;*/
    uint16_t fl_Last_Displayed_Level_u16;
    
    /**: Get current fuel level from ADC;*/
    usCurrentFuelLevel = usADCValue;
#if(FuelApp_TestMacro ==1)
    printf("CFL-%d\r\n",usCurrentFuelLevel);
#endif
    /**:Get the last displayed fuel level from dampout value;*/
    fl_Last_Displayed_Level_u16 = (uint16_t)ulDampout_value;
    /**:Calculate the difference between current fuel level and last displayed levels;*/
    if(usCurrentFuelLevel > fl_Last_Displayed_Level_u16)
    {  
        fl_delta_u16 = usCurrentFuelLevel - fl_Last_Displayed_Level_u16;
    }
    else
    {
        fl_delta_u16 = fl_Last_Displayed_Level_u16 - usCurrentFuelLevel;
    }
    /**:Determine fill type based on the difference;*/
    /**check if delta is greater than or equal to configFAST_FILL_RANGE*/
    if(fl_delta_u16 >= configFAST_FILL_RANGE)
    {
    	/**: set fill type is Fast_fill;*/
        l_res_t = Fast_fill;
    }
    /**check if delta is greater than or equal to  configSLOW_FILL_RANGE and less than configFAST_FILL_RANGE*/
    else if((fl_delta_u16 >= configSLOW_FILL_RANGE) && (fl_delta_u16< configFAST_FILL_RANGE))
    {
    	/**: set fill type is Slow_fill;*/
        l_res_t = Slow_fill;
    }
    else
    {
    	/**: set fill type is Normal_fill;*/
        l_res_t = Normal_fill;
    }
    /**:Return the fill type state;*/
    return l_res_t;
    
