kurella-saikumar/eStar_InstrumentCluster/eStar_Cluster_Demo/STM32CubeIDE/Application/User/Core/src/App/FuelGuage/FuelGuage_App.c
}

/**************************************************************************************************
 * Function Name:  prvSetFuelLevel
 *
 * Input Parameter: void
 *
 * Return Value: void
 *
 * Description: This function is designed to set the fuel level in percentage.#ifdef FuelApp_TestMacro
 *
 ***************************************************************************************************/
static void prvSetFuelLevel(void)
{
	/**: Calculate fuel level as a percentage;*/
    ulFuelLevelInPercentage = (ulDampout_value * 100)/(configMAXIMUM_ADC_RANGE);
#if(FuelApp_TestMacro ==1)
    printf("DO: %lu\t FL:%lu\r\n",ulDampout_value, ulFuelLevelInPercentage);
#endif
}

/**************************************************************************************************
 * Function Name: xGetFuelLevel
 *
 * output Parameters: ucFuelWarning_Indictr, Warning_status
 *
 * Return Value: Fuel level in percentage
 *
 * Description: This function is designed to get the Updated FuelLevel and providing the status of Fuel bar and Fuel Icon
 *
 ***************************************************************************************************/
uint8_t xGetFuelLevel(IndicationStatus_t* pucFuelWarning_Indictr_u16p, bool* p_Warning_status_bool)
{
	/**:Variable to store the fuel level;*/
    uint8_t fl_FuelLevel_Res_u8 = 0 ;
    /**:Initialize warning status to false;*/
    *p_Warning_status_bool=false;
    /**:Get fuel level as a percentage;*/
    fl_FuelLevel_Res_u8 = (uint8_t)ulFuelLevelInPercentage;
    /**check if fl_FuelLevel_Res_u8 is less than or equeal to configWARNING_FUELLEVEL*/
    if(fl_FuelLevel_Res_u8 <= configWARNING_FUELLEVEL)
    {
       /**:Set warning status to true;*/
       *p_Warning_status_bool=true;
       /**:Update fuel warning indicator;*/
       pucFuelWarning_Indictr_u16p->indicators.Fuel_warning_indicator=1;
    }
    /**:Return the fuel level;*/
	return fl_FuelLevel_Res_u8;
}

/**************************************************************************************************
 * Function Name: prvCalculateAverage
 *
 * Input Parameter: void
 *
 * Return Value: return the average value.
 *
 * Description: This function is designed to get the average value of ADC raw inputs for 3sec time period.
 *
 ***************************************************************************************************/
static uint16_t prvCalculateAverage(void)
{
	/**:Variable to store the calculated average;*/
    uint16_t fl_average_u16;
    /**:Calculate the average by dividing the total sum by the window size;*/
    fl_average_u16 = usTotalSum / configWINDOW_SIZE;
    /**:Return the calculated average;*/
    return fl_average_u16;

}



